#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/neptune-software/poc-seb-tfdevsecops/runs/run-Y5kM7HusPRheXSmd

Waiting for the plan to start...

Terraform v1.0.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_virtual_network.poc-vnet will be created
  + resource "azurerm_virtual_network" "poc-vnet" {
      + address_space         = [
          + "10.0.0.0/16",
        ]
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "westeurope"
      + name                  = "vnet-poc-dev-westeurope"
      + resource_group_name   = "poc-tf"
      + subnet                = (known after apply)
      + vm_protection_enabled = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

**Pusher: @saguadob, Action: `pull_request`**